In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (2.2.1)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\hp\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
#Excel  - 1M - large data set it wont be good
#Python - own logic 
#Pandas - predfined logic

In [1]:
i =1
j =1 
print(i+j)

2

In [5]:
import pandas as pd
#Dataframe
#row 3
#column 1
# [ [] [] [] ]
#DataFrame class

#          0        1        2
mylist=['Chennai','Mumai','Bangalor']
mylist

['Chennai', 'Mumai', 'Bangalor']

In [9]:
import pandas as pd
#Dataframe
#row 3
#column 1
# [ [] [] [] ]
#DataFrame class

#          0        1        2
mylist=['Chennai','Mumai','Bangalor']
df=pd.DataFrame(mylist)
df

          0
0   Chennai
1     Mumai
2  Bangalor

In [10]:
df.columns=["place"]#add
df

      place
0   Chennai
1     Mumai
2  Bangalor

In [11]:
df.columns=["placeName"]#rename
df

  placeName
0   Chennai
1     Mumai
2  Bangalor

In [12]:
header=["placeName"]
df.columns=header#rename
df

  placeName
0   Chennai
1     Mumai
2  Bangalor

In [13]:
df['placeName']

0     Chennai
1       Mumai
2    Bangalor
Name: placeName, dtype: object

In [14]:
type(df['placeName'])

pandas.core.series.Series

In [15]:
mylist=[ 
       ['Tamil','English','Maths'],
       [90,85,100]
       ]
mylist

[['Tamil', 'English', 'Maths'], [90, 85, 100]]

In [16]:
#['Tamil','English','Maths'] 3 row, 1 colum
#[['Tamil', 'English', 'Maths'], [90, 85, 100]] # 2 rows ,3 columns

df=pd.DataFrame(mylist)
df

       0        1      2
0  Tamil  English  Maths
1     90       85    100

In [17]:
mylist=[ 
       ['Tamil',90],
       ['English',85],
     ['Maths',100]
       ]
mylist

[['Tamil', 90], ['English', 85], ['Maths', 100]]

In [18]:

df=pd.DataFrame(mylist)
df

         0    1
0    Tamil   90
1  English   85
2    Maths  100

In [19]:
header=["Subjects","Marks"]
df.columns=header#rename
df

  Subjects  Marks
0    Tamil     90
1  English     85
2    Maths    100

In [20]:
mylist=[ 
       ['Tamil',90],
       ['English',85],
     ['Maths',100]
       ]

df=pd.DataFrame(mylist,columns=["Subjects","Marks"])
df

  Subjects  Marks
0    Tamil     90
1  English     85
2    Maths    100

In [21]:
mylist=[ 
       ['Tamil',90,"A"],
       ['English',85,"O"],
     ['Maths',100,"O+"]
       ]
#A,O,O+
df=pd.DataFrame(mylist,columns=["Subjects","Marks","Grades"])
df

  Subjects  Marks Grades
0    Tamil     90      A
1  English     85      O
2    Maths    100     O+

In [22]:
mylist=[ 
       ['Tamil',90,"A"],
       ['English',85,"O"],
     ['Maths',100,"O+"]
       ]
#A,O,O+
df=pd.DataFrame(mylist,columns=["Subjects","Marks","Grades"],index=["A","B","C"])
df

  Subjects  Marks Grades
A    Tamil     90      A
B  English     85      O
C    Maths    100     O+

In [25]:
df.rename(columns={"Subjects":"Sub","Marks":"M", "Grades":"G"})
df

  Subjects  Marks Grades
A    Tamil     90      A
B  English     85      O
C    Maths    100     O+

In [26]:
df.rename(columns={"Subjects":"Sub","Marks":"M", "Grades":"G"},inplace=True)
df

       Sub    M   G
A    Tamil   90   A
B  English   85   O
C    Maths  100  O+

In [29]:
mydic={
"Subjects":['Tamil',"English","Maths"],
      "Marks": [90,85,100],
   "Grades":  ["A","O","O+"]
}
df=pd.DataFrame(mydic)
df

  Subjects  Marks Grades
0    Tamil     90      A
1  English     85      O
2    Maths    100     O+

In [31]:
df.shape
#it will give total row and columns

(3, 3)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Subjects  3 non-null      object
 1   Marks     3 non-null      int64
 2   Grades    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [33]:
df.describe()

            Marks
count    3.000000
mean    91.666667
std      7.637626
min     85.000000
25%     87.500000
50%     90.000000
75%     95.000000
max    100.000000

In [34]:
df.columns

Index(['Subjects', 'Marks', 'Grades'], dtype='object')

In [35]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['Subjects', 'Marks', 'Grades'], dtype='object')]

In [36]:
df

  Subjects  Marks Grades
0    Tamil     90      A
1  English     85      O
2    Maths    100     O+

In [38]:
df=df.astype({"Marks":float})
df

  Subjects  Marks Grades
0    Tamil   90.0      A
1  English   85.0      O
2    Maths  100.0     O+

In [39]:
df.Marks

0     90.0
1     85.0
2    100.0
Name: Marks, dtype: float64

In [41]:
df['Marks']

0     90.0
1     85.0
2    100.0
Name: Marks, dtype: float64

In [42]:
df.loc[2] # row

Subjects    Maths
Marks       100.0
Grades         O+
Name: 2, dtype: object

In [2]:
df.loc[1:2]

NameError: name 'df' is not defined

In [44]:
df.iloc[1,2]

'O'

In [45]:
df

  Subjects  Marks Grades
0    Tamil   90.0      A
1  English   85.0      O
2    Maths  100.0     O+

In [47]:
df.iloc[2,1] #row col

100.0